# Ultralytics YOLO 🚀, AGPL-3.0 license

# Parameters
nc: 6 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 512] 
  s: [0.33, 0.50, 512] 
  m: [0.67, 0.75, 768] 
  l: [1.00, 1.00, 512] 
  x: [1.00, 1.25, 512] 

# MS-RDDNet backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, DWConv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, DWConv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f_MSGC, [128, True]]
  - [-1, 1, DWConv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f_MSGC, [256, True]]
  - [-1, 1, DWConv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f_MSGC, [512, True]]
  - [-1, 1, DWConv, [512, 3, 2]] # 7-P5/32
  - [-1, 3, C2f_MSGC, [512, True]]
  - [-1, 1, SPPF, [512, 5]] # 9


# MS-RDDNet head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 15 (P3/8-small)
  - [-1, 1, MSDHA, [256]]  # 16

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 19 (P4/16-medium)
  - [-1, 1, MSDHA, [512]]  # 20

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [512]] # 23 (P5/32-large)
  - [-1, 1, MSDHA, [512]]  # 24

  - [[16, 20, 24], 1, LMSADet, [nc]] # Detect(P3, P4, P5)